# 1. Напишите программу, которая просит пользователя ввести своё имя при запуске. Затем программа должна вывести приветствие с использованием введённого имени.

# variables
name = ""


# func
print("Enter your name: ")
name = input()
print("Hi,", name)
